app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find params[:id]

INSERT INTO `users` (`name`, `email`, `password_digest`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES ('hoang hoa tham', 'hoanghoatham@gamil.com', '$2a$10$Sc3ToI3LRDxiwRmxXlhr6.i2N5QLI.VTpBbBKKpvScwzhItTyXGVq', '1024.jpeg', 'image/jpeg', 9754, '2015-03-31 09:50:27.801088', '2015-03-31 09:50:27.995323', '2015-03-31 09:50:27.995323')
---
  def create
    @user = User.new user_params
    flash[:info] = "Thanks you for signup!"
   redirect_to root_url
    if @user.save